
export const db = [
    ['Интерьер и отделка',
        ["Напольные покрытия",
            [
                "Ламинат",
                "Паркетная доска",
                "Линолеум",
                "Ковры",
                "Ковровые покрытия",
                "Виниловый пол",
                "Подложка",
                "Средства для укладки ламината",
                "Напольные плинтуса",
                "Порожки и обводы",
                "Искусственная трава",
                "Воск мебельный",
                "Смеси для пола",

            ]
        ],
        ["Плитка керамическая и сопутствующие товары",
            [
                "Керамическая плитка",
                "Мозаика",
                "Фуга",
                "Крестики для плитки",
                "Системы выравнивания плитки",
                "Уголки, профили и ленты",
                "Защитные средства и очистители",
                "Декоративный камень"
            ]
        ],
        ["Камень декоративный и сопутствующие товары",
            [
                "Декоративный камень",
                "Облицовочный кирпич",
                "Формы для изготовления камня"
            ]
        ],
        ["Лакокрасочные материалы",
            [
                "Краски",
                "Эмали",
                "Колеры для краски",
                "ЛКМ аэрозольные",
                "Лаки",
                "Пропитки",
                "Масла",
                "Грунтовки",
                "Растворители и очистители",
                "Шпаклевка",
                "Лакокрасочные материалы для авто",
            ]
        ],
        ["Пены, клеи, герметики",
            [
                "Пена монтажная",
                "Герметики",
                "Клеи",
                "Очистители",
                "Пистолеты для герметиков и пены",
                "Автомобильные клея и герметики"
            ]
        ],
        ["Панели для отделки стен",
            [
                "Панели ПВХ",
                "Панели МДФ",
                "Рейки МДФ",
                "Комплектующие к панелям",
                "Пленка декоративная"
            ]
        ],
        ["Двери",
            [
                "Аксессуары к дверным ручкам",
                "Двери входные",
                "Двери межкомнатные",
                "Ручки дверные",
                "Наличники, коробки, доборные элементы",
                "Арки",
                "Защелки для межкомнатных дверей",
                "Материалы для обивки дверей",
                "Замки",
                "Петли",
                "Дверная фурнитура",

            ]
        ],
        ["Фурнитура и скобяные изделия",
            [
                "Замки",
                "Петли",
                "Дачная фурнитура",
                "Дверная фурнитура",
                "Кухонная фурнитура",
                "Мебельная фурнитура"
            ]
        ],
        ["Окна и комплектующие",
            [
                "Окна",
                "Москитные сетки",
                "Подоконники",
                "Завертки и ручки оконные",
                "Петли оконные",
                "Уплотнитель"
            ]
        ],
        ["Карнизы, шторы, жалюзи",
            [
                "Шторы",
                "Рулонные шторы",
                "Аксессуары для штор",
                "Жалюзи",
                "Карнизы",
                "Комплектующие для карнизов"
            ]
        ],
        ["Обои",
            [
                "Клеи"
            ]
        ],
        ["Потолочные системы",
            [
                "Плинтус полистирольный",
                "Плиты полистирольные",
                "Розетка полистирольная",
                "Стеклохолст"
            ]
        ],
        ["Декоративные элементы",
            [
                "Декоративные панели, экраны для радиаторов",
                "Декоративные уголки",
                "Молдинги, багеты интерьерные",
                "Наклейки",
                "Пробка для стен"
            ]
        ]
    ],
    ['Благоустройство',
        ["Садовая техника",
            [
                "Триммеры",
                "Газонокосилки",
                "Культиваторы и мотоблоки",
                "Мотобуры",
                "Пилы цепные",
                "Кусторезы",
                "Измельчители веток",
                "Аэраторы/скарификаторы",
                "Дровоколы",
                "Воздуходувки и пылесосы"
            ]
        ],
        ["Комплектующие для садовой техники",
            [
                "Лески косильные",
                "Цепи пильные",
                "Запчасти к моторной технике",
                "Свечи зажигания",
                "Напильники для заточки цепей",
                "Ножи к газонокосилкам",
                "Оснастка к культиваторам и мотоблокам",
                "Триммерные головки",
                "Шины к цепным пилам"
            ]
        ],
        ["Садовый инструмент",
            [
                "Вилы",
                "Грабли",
                "Лопаты",
                "Обрезочный инструмент",
                "Прополочный инструмент",
                "Черенки",
                "Пилы цепные",
                "Кусторезы",
                "Воздуходувки и пылесосы"
            ]
        ],
        ["Чистящая и моющая техника",
            [
                "Мойки высокого давления",
                "Оснастка к мойкам высокого давления",
                "Подметальные машины"
            ]
        ],
        ["Снегоуборочная техника и инвентарь",
            [
                "Ледорубы",
                "Снегоуборщики",
                "Противогололедные реагенты"
            ]
        ],
        ["Тачки и компостеры",
            [
                "Тачки",
                "Тележки",
                "Колеса, камеры",
                "Активаторы компоста"
            ]
        ],
        ["Емкости, полив",
            [
                "Баки и бочки",
                "Канистры/бидоны пищевые",
                "Катушки для шлангов, держатели",
                "Лейки",
                "Опрыскиватели",
                "Пистолеты, наконечники",
                "Поливочные фитинги",
                "Системы полива",
                "Шланги"
            ]
        ],
        ["Обустройство сада",
            [
                "Заборчики садовые",
                "Ленты для края газона",
                "Опоры садовые для растений",
                "Покрытие садовое",
                "Пруды декоративные",
                "Сетки оградительные",
                "Фигурки садовые",
                "Тротуарная плитка",
                "Формы для плитки/бордюра",
                "Щебень (камень), щепа"
            ]
        ],
        ["Садовая мебель",
            [
                "Столы садовые",
                "Стулья садовые",
                "Скамейки",
                "Кресла подвесные",
                "Кровати раскладные",
                "Шезлонги",
                "Набор мебели",
                "Гамаки",
                "Качели",
                "Зонты садовые",
                "Шатры/навесы",
                "Аксессуары для мебели",
                "Детская площадка"
            ]
        ],
        ["Дачная сантехника",
            [
                "Биотуалеты",
                "Жидкость для биотуалета",
                "Души садовые",
                "Умывальники дачные",
                "Средства для выгребных ям и септиков"
            ]
        ],
        ["Заборы и ограждения",
            [
                "Сетка рабица",
                "Крышки и колпаки для заборов",
                "Металлоштакетники",
                "Ворота, панели",
                "Мотобуры",
                "Профнастил",
                "Столб",
                "Фурнитура для столба"
            ]
        ],
        ["Уход за растениями",
            [
                "Теплицы и парники",
                "Грядки и клумбы",
                "Укрывочные материалы для растений",
                "Почвогрунт",
                "Удобрения",
                "Побелка",
                "Защита растений",
                "Горшки и вазоны",
                "Крепления для кашпо",
                "Аксессуары для растений",
                "Лейки"
            ]
        ],
        ["Семена и растения",
            [
                "Семена",
                "Саженцы",
                "Цветы и растения",
                "Кактусы и суккуленты"
            ]
        ],
        ["Товары для фермерского хозяйства",
            [
                "Доильные аппараты",
                "Измельчители кормов",
                "Инкубаторы для яиц",
                "Оборудование для приготовления алкоголя",
                "Поилки и кормушки для с/х животных",
                "Термоконтейнеры"
            ]
        ]
    ],
    ['Стройматериалы',
        ["Изоляционные материалы",
            [
                "Минеральная вата",
                "Экструдированный пенополистирол",
                "Теплоотражающая изоляция",
                "Шумоизоляция",
                "Межвенцовый утеплитель",
                "Гидро-пароизоляционные пленки",
                "Гидроизоляционные ленты",
                "Пенополиэтилен"
            ]
        ],
        ["Строительные смеси",
            [
                "Сухие строительные смеси",
                "Клеевые смеси",
                "Штукатурка",
                "Шпаклевка",
                "Гидроизоляция",
                "Кладочные смеси",
                "Смеси для пола",
                "Добавки для строительных смесей",
                "Грунтовки"
            ]
        ],
        ["Кровля и водосточные системы",
            [
                "Водосточные системы",
                "Поликарбонат и доборные элементы",
                "Битумные листы",
                "Шифер",
                "Битумная черепица",
                "Рубероид, пергамин",
                "Наплавляемая кровля",
                "Ленты битумные",
                "Холодные мастики, праймер",
                "Доборные элементы кровли",
                "Аэраторы и манжеты",
                "Отливы, коньки, зонты, свесы",
                "Поликарбонатные козырьки",
                "Гидро-пароизоляционные пленки"
            ]
        ],
        ["Устройство стен и потолка",
            [
                "Гипсоволокнистые листы (ГВЛ)",
                "Гипсокартон (ГКЛ)",
                "Потолочные плиты",
                "Подвесной потолок и комплектующие",
                "Аквапанели",
                "Демпферная лента",
                "Ленты для швов листовых материалов",
                "Профили для монтажа г/к систем",
                "Монтажные элементы",
                "Уголки и маяки",
                "Грунтовки",
                "Шпаклевка"
            ]
        ],
        ["Древесно-плитные материалы",
            [
                "OSB",
                "ДВП",
                "ДСП",
                "МДФ, ХДФ",
                "Фанера",
                "ЦСП"
            ]
        ],
        ["Пиломатериалы",
            [
                "Блок-хаус",
                "Брус",
                "Вагонка",
                "Доска",
                "Жалюзийные дверцы",
                "Заборы",
                "Имитация бруса",
                "Наличник, нащельник",
                "Планкен",
                "Плинтус деревянный",
                "Раскладка",
                "Террасные доски",
                "Уголок",
                "Штапик",
                "Щит срaщенный"
            ]
        ],
        ["Металлопрокат",
            [
                "Алюминиевый прокат",
                "Арматура",
                "Декоративный металлопрокат",
                "Листовой материал",
                "Проволока",
                "Профнастил",
                "Столб",
                "Труба",
                "Уголок металлический"
            ]
        ],
        ["Общестроительные материалы",
            [
                "Укрывные материалы",
                "Сетки строительные"
            ]
        ],
        ["Стеновые и фасадные материалы",
            [
                "Блоки",
                "Кирпич",
                "Сайдинг и комплектующие",
                "Фасадные панели",
                "Тротуарная плитка"
            ]
        ]
    ],
    ['Инструмент',
        ["Электроинструмент",
            [
                "Шуруповерты",
                "Перфораторы",
                "Отбойные молотки и оснастка к ним",
                "Дрели",
                "Лобзики",
                "Фены строительные",
                "Шлифовальные машины",
                "Рубанки",
                "Фрезеры",
                "Пилы циркулярные",
                "Пылесосы промышленные",
                "Термоклеевые пистолеты",
                "Граверы",
                "Миксеры строительные",
                "Краскораспылители",
                "Гайковерты",
                "Многофункциональные инструменты",
                "Сабельные пилы",
                "Степлеры (скобозабиватели)",
                "Бороздоделы",
                "Аккумуляторы",
                "Приспособления для электроинструмента",
                "Запчасти для электроинструмента и техники"
            ]
        ],
        ["Ручной инструмент",
            [
                "Резьбонарезной инструмент",
                "Слесарный инструмент",
                "Столярный инструмент",
                "Ящики для инструмента, органайзеры",
                "Строительный инструмент",
                "Электротехнический инструмент",
                "Малярный инструмент"
            ]
        ],
        ["Расходные материалы к инструменту",
            [
                "Абразивные материалы",
                "Абразивы на мягкой основе",
                "Алмазные диски и чашки",
                "Биты и держатели",
                "Диски пильные",
                "Зубила и пики",
                "Коронки",
                "Круги абразивные",
                "Материалы для полировки",
                "Наборы оснастки",
                "Ножи для фуганков и рубанков",
                "Оснастка для гравировки",
                "Патроны сверлильные",
                "Пилки к лобзикам/ножовкам",
                "Сверла",
                "Тарелки опорные",
                "Фрезы",
                "Шлифштифты (шарошки)",
                "Щетки проволочные и абразивные",
                "Аккумуляторы"
            ]
        ],
        ["Газовое и сварочное оборудование",
            [
                "Сварочные аппараты",
                "Маски сварщика",
                "Электроды",
                "Газовые баллоны",
                "Горелки газовые",
                "Шкафы для газовых баллонов",
                "Комплектующие к горелкам полуавтоматов",
                "Лампы паяльные бензиновые",
                "Проволока сварочная",
                "Редукторы, манометры и прочие комплектующие",
                "Резаки газосварочные",
                "Стекла сварщика",
                "Шланги газовые",
                "Электрододержатели и зажимы"
            ]
        ],
        ["Спецодежда и средства защиты",
            [
                "Антисептики",
                "Защита лица, глаз, головы",
                "Защита органов дыхания",
                "Наколенники",
                "Обувь",
                "Пожарное оборудование",
                "Рукавицы, перчатки",
                "Спецодежда"
            ]
        ],
        ["Хозтовары, расходные материалы",
            [
                "Веревки, канаты",
                "Ленты клейкие",
                "Ленты, пряжки",
                "Мешковина, мешки",
                "Пакеты упаковочные",
                "Термометры бытовые",
                "Стрейч-пленка",
                "Строительные емкости"
            ]
        ],
        ["Пневмоинструмент",
            [
                "Компрессоры воздушные",
                "Гайковерты, шлифмашины, дрели, молотки",
                "Оснастка к пневмоинструменту",
                "Пистолеты обдува, моечные, степлеры",
                "Распылители"
            ]
        ],
        ["Высотные конструкции",
            [
                "Лестницы и стремянки",
                "Лестницы чердачные",
                "Элементы лестниц"
            ]
        ],
        ["Измерительные инструменты",
            [
                "Дальномеры",
                "Индикаторы, щупы, термометры",
                "Линейки, метры, угольники",
                "Металлокабелеискатели",
                "Нивелиры",
                "Электроизмерительные приборы",
                "Принадлежности",
                "Рулетки",
                "Уровни, отвесы",
                "Штангенциркули"
            ]
        ],
        ["Станки и оборудование",
            [
                "Верстаки",
                "Плиткорезы электрические",
                "Станки деревообрабатывающие",
                "Станки сверлильные",
                "Станки точильно-шлифовальные"
            ]
        ],
        ["Силовая и строительная техника",
            [
                "Бетоносмесители",
                "Виброплиты, вибраторы",
                "Генераторы",
                "Запчасти строительной техники"
            ]
        ]
    ],
    ['Мебель',
        ["Мебель для спальни",
            [
                "Кровати",
                "Матрасы",
                "Комоды и тумбы",
                "Туалетные столики"
            ]
        ],
        ["Мягкая мебель",
            [
                "Кресла",
                "Диваны"
            ]
        ],
        ["Мебель столовая",
            [
                "Обеденные группы",
                "Столы",
                "Стулья"
            ]
        ],
        ["Мебель для кухни",
            [
                "Готовые кухни",
                "Корпуса",
                "Модульные кухни",
                "Подстолья и опоры",
                "Скинали кухонные",
                "Столешницы",
                "Фасады",
                "Кухонная фурнитура",
                "Ноги мебельные",
                "Пленка декоративная",
                "Мойки кухонные",
                "Шланги сантехнические"
            ]
        ],
        ["Мебель для прихожих",
            [
                "Банкетки",
                "Вешалки",
                "Гардеробные",
                "Полки для обуви",
                "Секции для прихожей",
                "Чехлы, кофры",
                "Крючки",
                "Коврики придверные",
                "Зеркала"
            ]
        ],
        ["Мебель офисная",
            [
                "Журнальные столики",
                "Компьютерные столы",
                "Кресла, стулья",
                "Массажные кресла"
            ]
        ],
        ["Мебель для ванной",
            [
                "Зеркала и зеркальные шкафы",
                "Пластиковые наборы",
                "Тумбы под раковину",
                "Шкафы"
            ]
        ],
        ["Мебельная фурнитура",
            [
                "Держатели и уголки",
                "Детская безопасность",
                "Заглушки пластиковые",
                "Защелки",
                "Колеса мебельные",
                "Кромка и профиль С ПВХ",
                "Кронштейны для полок",
                "Крючки",
                "Мебельный крепеж",
                "Направляющие для ящиков",
                "Ноги мебельные",
                "Петли мебельные",
                "Сейфы",
                "Фурнитура для шкафов",
                "Ящик почтовый"
            ]
        ],
        ["Системы хранения",
            [
                "Комоды",
                "Коробки, корзины, ящики",
                "Стеллажи",
                "Этажерки хозяйственные"
            ]
        ]
    ],
    ['Бытовая техника',
        ["Крупногабаритная бытовая техника",
            [
                "Холодильники",
                "Стиральные машины",
                "Сушильные машины",
                "Плиты кухонные",
                "Винные шкафы"
            ]
        ],
        ["Встраиваемая техника",
            [
                "Варочные поверхности",
                "Вытяжки",
                "Духовые шкафы",
                "Посудомоечные машины",
                "Шкафы для подогрева посуды"
            ]
        ],
        ["Климатическая техника",
            [
                "Вентиляторы",
                "Увлажнители воздуха",
                "Кондиционеры",
                "Радиочасы, метеостанции"
            ]
        ],
        ["Техника для подготовки продуктов",
            [
                "Сушилки для овощей и фруктов",
                "Вакууматоры",
                "Весы кухонные"
            ]
        ],
        ["Техника для измельчения продуктов",
            [
                "Блендеры",
                "Миксеры кухонные",
                "Мясорубки",
                "Кухонные комбайны",
                "Ломтерезки",
                "Измельчители"
            ]
        ],
        ["Техника для приготовления еды",
            [
                "Аэрогрили",
                "Электрогрили",
                "Микроволновые печи",
                "Мини-духовки",
                "Мультиварки и пароварки",
                "Хлебопечки",
                "Настольные плиты",
                "Тостеры",
                "Вафельницы, сэндвичницы",
                "Фритюрницы",
                "Блинницы",
                "Йогуртницы и мороженицы",
                "Яйцеварки"
            ]
        ],
        ["Техника для приготовления напитков",
            [
                "Электрочайники",
                "Кофеварки и кофемашины",
                "Соковыжималки",
                "Кофемолки",
                "Ледогенераторы"
            ]
        ],
        ["Техника для уборки",
            [
                "Пылесосы",
                "Паровые швабры",
                "Пароочистители",
                "Электрические стеклоочистители",
                "Электровеники"
            ]
        ],
        ["Техника для ухода за одеждой и обувью",
            [
                "Утюги",
                "Отпариватели",
                "Швейные машины",
                "Машинки для удаления катышков",
                "Электросушилки для обуви"
            ]
        ],
        ["Техника для красоты и здоровья",
            [
                "Весы напольные",
                "Фены",
                "Плойки, щипцы, выпрямители для волос",
                "Машинки для стрижки",
                "Электробритвы",
                "Эпиляторы",
                "Стерилизаторы"
            ]
        ],
        ["Комплектующие и аксессуары",
            [
                "Аксессуары для встраиваемой техники",
                "Аксессуары для стиральных машин",
                "Комплектующие к вытяжкам",
                "Кронштейны для СВЧ",
                "Пылесборники",
                "Комплектующие для пылесосов",
                "Насадки для кухонных комбайнов"
            ]
        ]
    ],
    ['Сантехника',
        ["Ванны и экраны",
            [
                "Ванны",
                "Экраны для ванны",
                "Комплектующие для ванн"
            ]
        ],
        ["Раковины, пьедесталы",
            [
                "Умывальники",
                "Пьедесталы",
                "Комплектующие для раковин"
            ]
        ],
        ["Мойки кухонные",
            [
                "Мойки из искусственного камня",
                "Мойки из стали",
                "Измельчители бытовых отходов",
                "Комплектующие для кухонных моек"
            ]
        ],
        ["Унитазы и биде",
            [
                "Унитазы",
                "Писсуары",
                "Биде",
                "Комплектующие к унитазам"
            ]
        ],
        ["Душевые кабины и ограждения",
            [
                "Душевые кабины",
                "Душевые ограждения",
                "Поддоны душевые",
                "Сливные трапы",
                "Запчасти к душевым кабинам"
            ]
        ],
        ["Смесители и душевые системы",
            [
                "Смесители для кухонной мойки",
                "Смесители для ванны",
                "Смесители для умывальника",
                "Смесители для душа",
                "Смесители для биде",
                "Душевые системы и гарнитуры",
                "Запчасти и комплектующие смесителей"
            ]
        ],
        ["Системы инсталляции",
            [
                "Инсталляции",
                "Комплектующие для инсталляций"
            ]
        ],
        ["Полотенцесушители",
            [
                "Полотенцесушители водяные",
                "Полотенцесушители электрические",
                "Комплектующие к полотенцесушителям"
            ]
        ],
        ["Аксессуары для ванной и туалета",
            [
                "Мыльницы",
                "Дозаторы для мыла",
                "Стаканы для щеток",
                "Наборы аксессуаров",
                "Полки для принадлежностей",
                "Держатели и крючки",
                "Ершики",
                "Коврики для ванной и туалета",
                "Шторки для ванной",
                "Карнизы для ванной",
                "Поручни",
                "Сушилки для рук",
                "Прочие аксессуары"
            ]
        ],
        ["Комплектующие для сантехники",
            [
                "Сифоны",
                "Аксессуары и запасные части к сифонам",
                "Шланги сантехнические"
            ]
        ],
        ["Мебель для ванной",
            [
                "Зеркала и зеркальные шкафы",
                "Пластиковые наборы",
                "Тумбы под раковину",
                "Шкафы"
            ]
        ],
        ["Крепеж для сантехники", []]
    ],
    ['Электрика',
        ["Освещение",
            [
                "Потолочные светильники",
                "Люстры",
                "Настенные светильники",
                "Настольные лампы",
                "Торшеры",
                "Точечные светильники",
                "Подсветка",
                "Уличное освещение",
                "Аксессуары для освещения",
                "Лампочки",
                "Датчики движения",
                "Переноски",
                "Светильники для дома",
                "Таймеры"
            ]
        ],
        ["Фонари и элементы питания",
            [
                "Фонарики",
                "Батарейки и аккумуляторы",
                "Зарядные устройства"
            ]
        ],
        ["Электромонтажное оборудование",
            [
                "Розетки и выключатели",
                "Накладки под выключатель",
                "Монтажные коробки, подрозетники",
                "Вилки, штепсели",
                "Электротехнический инструмент"
            ]
        ],
        ["Электрощитовое оборудование",
            [
                "Клеммы и зажимы для проводов",
                "DIN-рейки и комплектующие",
                "Термоусаживаемые трубки",
                "Корпуса для электрооборудования",
                "Шины нулевые",
                "Шины соединительные",
                "Электросчетчики"
            ]
        ],
        ["Кабель и системы прокладки",
            [
                "Силовые кабели, провода",
                "Кабель-каналы",
                "Гофротрубы, трубы монтажные",
                "Металлорукава",
                "Крепеж кабелей и кабеленесущих систем",
                "Наконечники, гильзы кабельные",
                "Протяжки кабельные"
            ]
        ],
        ["Модульная автоматика",
            [
                "Автоматические выключатели",
                "УЗО",
                "УЗИП и молниезащита",
                "Дифференциальные автоматы",
                "Выключатели нагрузки",
                "Реле и контакторы",
                "Предохранители и их компоненты",
                "Аксессуары для силового оборудования"
            ]
        ],
        ["Умный дом",
            [
                "Умные колонки"
            ]
        ],
        ["Удлинители и сетевые разъемы",
            [
                "Удлинители",
                "Комплектующие для удлинителей и шнуров",
                "Сетевые фильтры и разветвители"
            ]
        ],
        ["Системы наблюдения и оповещения",
            [
                "Звонки и домофоны",
                "Пожарные извещатели",
                "Таймеры",
                "Камеры видеонаблюдения"
            ]
        ],
        ["Инструмент и материалы для пайки",
            [
                "Паяльники",
                "Приспособления для пайки",
                "Флюсы и припои"
            ]
        ]
    ],
    ['Инженерные системы',
        ["Отопление",
            [
                "Обогреватели",
                "Радиаторы отопления",
                "Решетки радиаторные",
                "Теплый пол",
                "Арматура для радиаторов",
                "Теплоноситель",
                "Принадлежности для систем отопления",
                "Отопительные котлы"
            ]
        ],
        ["Водоснабжение",
            [
                "Водонагреватели",
                "Полипропиленовые системы",
                "Металлопластиковые системы",
                "Полиэтиленовые системы",
                "Изоляция, герметизация",
                "Фитинги резьбовые",
                "Запорная арматура",
                "Счетчики для воды",
                "Утеплители для труб",
                "Шланги сантехнические"
            ]
        ],
        ["Насосное оборудование",
            [
                "Насосы",
                "Гидроаккумуляторы",
                "Мотопомпы",
                "Шланги для насосов"
            ]
        ],
        ["Системы фильтрации воды",
            [
                "Фильтры-кувшины",
                "Картриджи",
                "Фильтры магистральные",
                "Фильтры проточные многоступенчатые",
                "Комплектующие для фильтров"
            ]
        ],
        ["Вентиляция",
            [
                "Вытяжные вентиляторы",
                "Решетки вентиляционные",
                "Воздуховоды и комплектующие",
                "Анемостаты и диффузоры"
            ]
        ],
        ["Печное оборудование",
            [
                "Печи",
                "Камины и порталы",
                "Дымоходы",
                "Аксессуары к печам и каминам",
                "Печное литье",
                "Кладочные смеси"
            ]
        ],
        ["Канализация",
            [
                "Трубы канализационные",
                "Фитинги канализационные",
                "Люки ревизионные",
                "Канализационные люки",
                "Манжеты",
                "Тросы сантехнические",
                "Вантузы",
                "Сливные трапы"
            ]
        ],
        ["Газоснабжение",
            [
                "Счетчики газа"
            ]
        ],
        ["Дренажные системы",
            [
                "Системы поверхностного водоотвода (дренажа)"
            ]
        ],
        ["Климатическая техника",
            [
                "Вентиляторы",
                "Увлажнители воздуха",
                "Кондиционеры",
                "Радиочасы, метеостанции"
            ]
        ]
    ],
    ['Крепеж',
        ["Саморезы и шурупы", []],
        ["Дюбели и дюбель-гвозди", []],
        ["Гвозди", []],
        ["Анкеры", []],
        ["Метрический крепеж",
            [
                "Болты",
                "Винты",
                "Гайки",
                "Конфирматы",
                "Шайбы",
                "Шпильки"
            ]
        ],
        ["Хомуты", []],
        ["Заклепки", []],
        ["Крепеж для конструкций",
            [
                "Крепление балки",
                "Перфорированный крепеж",
                "Скобы",
                "Уголки крепежные",
                "Фурнитура для столба",
                "Хромированные трубы"
            ]
        ],
        ["Такелаж",
            [
                "Тросы",
                "Цепи",
                "Страховочные устройства",
                "Комплектующие для тросов"
            ]
        ],
        ["Крепеж для сантехники", []],
        ["Прочий крепеж",
            [
                "Кронштейны для полок",
                "Кронштейны для СВЧ",
                "Кронштейны для ТВ"
            ]
        ]
    ],
    ['Автотовары',
        [
            "Масла и фильтры",
            [
                "Масла моторные",
                "Масляные фильтры"
            ]
        ],
        [
            "Технические жидкости",
            [
                "Стеклоомыватели",
                "Смазки",
                "Присадки",
                "Охлаждающие жидкости",
                "Масла трансмиссионные",
                "Тормозные жидкости",
                "Гидравлические жидкости",
                "Дистилляты"
            ]
        ],
        [
            "Шины и диски",
            [
                "Автомобильные шины",
                "Антипробуксовочные устройства",
                "Аксессуары для колес",
                "Инструмент для шиномонтажа"
            ]
        ],
        [
            "Автооборудование",
            [
                "Автомобильные аккумуляторы",
                "Пуско-зарядные устройства",
                "Домкраты",
                "Автомобильные компрессоры",
                "Автопылесосы",
                "Гидравлическое оборудование",
                "Подъемное оборудование"
            ]
        ],
        [
            "Автобезопасность",
            [
                "Детские автокресла",
                "Аварийные принадлежности"
            ]
        ],
        [
            "Материалы для кузовного ремонта",
            [
                "Автомобильные клея и герметики",
                "Лакокрасочные материалы для авто",
                "Автошпатлевки",
                "Антигравий",
                "Автоконсерванты",
                "Растворители и очистители"
            ]
        ],
        [
            "Автохимия",
            [
                "Автокосметика",
                "Очистители для авто",
                "Ароматизаторы",
                "Пасты для рук",
                "Щетки, губки, салфетки для мытья",
                "Мойки высокого давления"
            ]
        ],
        [
            "Автоэлектроника",
            [
                "Автомагнитолы",
                "Видеорегистраторы",
                "Динамики",
                "Сабвуферы",
                "Навигаторы",
                "Электроприборы"
            ]
        ],
        [
            "Автоаксессуары",
            [
                "Автомобильные коврики",
                "Аксессуары для салона авто",
                "Буксировочные тросы",
                "Канистры для ГСМ",
                "Хранение и крепление багажа",
                "Щетки стеклоочистителя",
                "Автомобильные лампы",
                "Скребки и щетки для снега",
                "Принадлежности для авто",
                "Держатели телефонов",
                "Фары",
                "Термосумки",
                "Свечи зажигания"
            ]
        ]
    ],
    ['Электроника',
        [
            "Телевидение",
            [
                "Телевизоры",
                "Кронштейны для ТВ",
                "Медиаплееры и Смарт-приставки",
                "Приемники цифрового ТВ",
                "Антенны ТВ"
            ]
        ],
        [
            "Смартфоны и гаджеты",
            [
                "Смартфоны и мобильные телефоны",
                "Зарядные устройства для смартфонов",
                "Док-станции и подставки",
                "Чехлы и защитные стекла"
            ]
        ],
        [
            "Аудиотехника",
            [
                "Музыкальные центры",
                "Портативная акустика",
                "Системы домашнего кинотеатра",
                "Умные колонки",
                "Компьютерная акустика",
                "Микрофоны",
                "Наушники и гарнитуры"
            ]
        ],
        [
            "Смарт-часы и Фитнес-трекеры",
            [
                "Умные часы",
                "Ремешки и аксессуары"
            ]
        ],
        [
            "Игровая зона",
            [
                "Аксессуары",
                "Геймпады",
                "Игры для консолей",
                "Ретро консоли"
            ]
        ],
        [
            "Фото, видеотехника",
            [
                "Осветительное оборудование",
                "Проекционные экраны",
                "Штативы, стабилизаторы"
            ]
        ],
        [
            "Комплектующие для ПК",
            [
                "Блоки питания",
                "Видеокарты",
                "Жесткие диски и SSD",
                "Комплектующие для серверов",
                "Комплектующие для стриминга",
                "Корпуса для компьютеров",
                "Материнские платы",
                "Оперативная память",
                "Оптические приводы",
                "Процессоры",
                "Системы охлаждения"
            ]
        ],
        [
            "Компьютерная периферия",
            [
                "Мониторы",
                "Системные блоки",
                "Мыши и клавиатуры",
                "Коврики для мыши",
                "Кабели Аудио и Видео",
                "Графические планшеты",
                "Стабилизаторы и ИБП"
            ]
        ],
        [
            "Накопители данных",
            [
                "USB-флешки",
                "Внешние жесткие диски",
                "Картридеры",
                "Карты памяти"
            ]
        ],
        [
            "Ноутбуки и аксессуары",
            [
                "Ноутбуки",
                "Планшеты",
                "Подставки для ноутбуков",
                "Сумки для ноутбуков"
            ]
        ],
        [
            "Сетевое оборудование",
            [
                "WIFI роутеры",
                "Коммутаторы",
                "Беспроводные адаптеры",
                "Кабели сетевые",
                "Опции для коммутаторов"
            ]
        ],
        [
            "Аксессуары для электроники",
            [
                "Чистящие средства для оргтехники"
            ]
        ],
        [
            "Офисная техника",
            [
                "Принтеры и МФУ",
                "Расходные материалы для печати",
                "Сканеры",
                "Счетчики, детекторы банкнот",
                "Телефония"
            ]
        ]
    ]
]



// const section = Array.from(document.querySelectorAll('.bordered-section.js-accordion-group'))[12]
// const data = Array.from(section.querySelectorAll('.catalog-all-item.col.col-lg-3-of-12.col-md-4-of-12.col-sm-6-of-12.col-xs-12-of-12'))
// const ff = []
// for (let i = 0, l = data.length; i < l; i++) {

//     const el = data[i].lastElementChild

//     const sendData = []
//     if (el) {
//         const title = el.firstElementChild.outerText
//         if (title) {
//             sendData.push(title)
//         }
//         const categor = el.lastElementChild.outerText.split("\n")
//         if (categor.length) {
//             sendData.push(categor.filter(_ => _ !== 'Свернуть'))
//         }
//     }
//     ff.push(sendData)
// }

// async function downloadImage(imageSrc) {
//     const nameImg = nameProdTrim + Date.now()
//     const image = await fetch('https://www.oma.by' + imageSrc)
//     const imageBlog = await image.blob()
//     const link = document.createElement('a')
//     link.href = URL.createObjectURL(imageBlog)
//     link.download = nameImg
//     link.click()
//     data.image.push({ link: `D:/parseData/image/${nameImg}.${imageSrc.split('.')[1]}` })
// }

// console.log(ff)
// async function initData(fullName) {
//     const nameProdTrim = fullName.trim().split(/\s|\./).join("")

//     const char = Array.from(document.querySelectorAll('.catalog-item-description_col .params-block'))
//     const data = { char: [], image: [] }

//     for (const elem of char) {
//         const elemTitle = elem.firstElementChild
//         const elemList = elem.querySelector('.params-block_list')
//         if (elemTitle && elemTitle.tagName === 'H2') {
//             if (elemList) {
//                 const sectionData = []
//                 for (const chatitem of elemList.children) {
//                     const name = chatitem.firstElementChild?.firstElementChild
//                     const value = chatitem.lastElementChild

//                     if (name && value) {
//                         sectionData.push({ name: name.innerText.trim(), value: value.innerText.trim() })
//                     }
//                 }
//                 data.char.push({ title: elemTitle.outerText, data: sectionData })
//             } else {
//                 const itemDescription = elem.querySelector('.catalog-item-description-txt_content')
//                 if (itemDescription) {
//                     data.desription = itemDescription.textContent?.trim()
//                 }
//             }
//         }
//     }


//     const dataImg = Array.from(document.querySelectorAll('.nav-slider_inner.js-preview-button'))

//     if (dataImg.length) {
//         for (const item of dataImg) {
//             const dataImage = item.dataset.fullImage
//             if (dataImage) {
//                 data.image.push({ link: 'https://www.oma.by' + dataImage })
//             }
//         }
//     } else {
//         const elemimg = document.querySelector('.slider-w-preview.js-preview-box img')
//         if (elemimg) {
//             const dataImg = elemimg.dataset.origSrc
//             if (dataImg) {
//                 data.image.push({ link: 'https://www.oma.by' + dataImg })
//             }
//         }
//     }

//     const elemArt = document.querySelector('.product-rating-code_code')
//     const item = document.querySelector('.catalog-item.js-catalog-item')
//     const dataCategor = item.dataset.gaCategoryPath
//     const dataBrand = item.dataset.gaProductBrand
//     const dataPrice = item.dataset.gaProductPrice

//     if (dataCategor) { data.categor = dataCategor }
//     if (dataBrand) { data.maker = dataBrand }
//     if (dataPrice) { data.price = parseInt(dataPrice) }
//     if (elemArt) {
//         const value = elemArt.innerText.split(': ')
//         data.itemArt = value[1]
//         data.itemMod = value[1]
//         data.quantity = Math.round(Math.random() * 666)
//         data.name = fullName.trim()
//         data.art = fullName.trim()
//     }

//     function downloadTextFile(text, name) {
//         const a = document.createElement('a');
//         a.href = URL.createObjectURL(new Blob([text], { type: `text/json` }));
//         a.download = name + '.json';
//         a.click();
//     }
//     downloadTextFile(JSON.stringify(data), nameProdTrim)
// }

// function createHTMLElementButton() {
//     const elembt = document.createElement('button')
//     elembt.textContent = 'Init Data'
//     elembt.style.position = 'fixed'
//     elembt.style.backgroundColor = '#416c44'
//     elembt.style.color = '#fff'
//     elembt.style.fontSize = '1.25rem'
//     elembt.style.borderRadius = '5px'
//     elembt.style.padding = '0.75rem 3rem'
//     elembt.style.top = '2rem'
//     elembt.style.left = '2rem'
//     elembt.style.zIndex = '999'
//     elembt.style.border = 'none'
//     return elembt
// }

// window.addEventListener('DOMContentLoaded', () => {
//     const item = document.querySelector('.catalog-item.js-catalog-item')
//     if (item) {
//         const dataName = item.dataset.gaProductName
//         if (dataName) {
//             initData(dataName)
//         }
//     } else {
//         const bt = createHTMLElementButton()
//         bt.onclick = () => {
//             const array = document.querySelectorAll(".product-item.product-item__grid")
//            let i = 0
//             for (const item of array) {
//                 if (item && i <12) {
//                     const ff = item.lastElementChild
//                     const link = ff?.getAttribute('href')
//                     const page = window.open(link)
//                     setTimeout(() => {
//                         page?.close()
//                     }, 15000);
//                     ++i
                    
//                 }
//             }
//         }
//         document.body.style.position = 'relative'
//         document.body.appendChild(bt)
//     }
// })



