export const CONFIRM_TITLE = {
    DELETE_SECTION: 'Вы хотите удалить этот раздел?',
    CANCEL_CREATE_SECTION: 'Вы хотите отменить создание раздела?',
    APPLY_EDIT_SECTION: 'Вы хотите применить изменения?',
    CANCEL_CREATE_PRODUCT: 'Вы хотите отменить создание товара, все данные будут сброшены?',
    CHECK_CHARACTERISTIC: 'В вашем списке характеристик есть эти свойства: "/REPLACE/". Если, для характеристики указано несколько вариантов, тогда их следует разделять косой чертой "/". Например: "черный/белый"'
}